Загрузите в колаб файлы по оценкам (ratings) и фильмам (movies) и создайте на их основе pandas-датафреймы

In [ ]:
import pandas as pd

In [ ]:
headers_r = ['user_id', 'item_id', 'rating','timestamp']

In [ ]:
df_ratings = pd.read_csv('u.data.csv', sep='\t', header=None, names=headers_r)

In [ ]:
df_ratings.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [ ]:
headers_m = ['movie id','movie title','release date','video release date','IMDb URL', 'unknown','Action','Adventure','Animation','Childrens','Comedy','Crime','Documentary','Drama','Fantasy','Film-Noir','Horror','Musical','Mystery','Romance','Sci-Fi','Thriller', 'War','Western']

In [ ]:
df_movies = pd.read_csv('u.item.csv', sep='|', header=None, names=headers_m)

In [ ]:
df_movies.head()

   movie id        movie title release date  ...  Thriller War  Western
0         1   Toy Story (1995)  01-Jan-1995  ...         0   0        0
1         2   GoldenEye (1995)  01-Jan-1995  ...         1   0        0
2         3  Four Rooms (1995)  01-Jan-1995  ...         1   0        0
3         4  Get Shorty (1995)  01-Jan-1995  ...         0   0        0
4         5     Copycat (1995)  01-Jan-1995  ...         1   0        0

[5 rows x 24 columns]

Средствами Pandas, используя dataframe ratings, найдите id пользователя, поставившего больше всего оценок

In [ ]:
df_topuser = df_ratings.groupby('user_id').count().sort_values('rating',ascending=False)
df_topuser.head()

         item_id  rating  timestamp
user_id
405          737     737        737
655          685     685        685
13           636     636        636
450          540     540        540
276          518     518        518

Оставьте в датафрейме ratings только те фильмы, который оценил данный пользователь

In [ ]:
df_tufilms = df_ratings['user_id'] == 405
df_405 = df_ratings.loc[df_tufilms]
df_405.head()

       user_id  item_id  rating  timestamp
12276      405       56       4  885544911
12383      405      592       1  885548670
12430      405     1582       1  885548670
12449      405      171       1  885549544
12460      405      580       1  885547447

Добавьте к датафрейму из задания 3 столбцы:
По жанрам. Каждый столбец - это жанр. Единицу записываем, если фильм принадлежит данному жанру и 0 - если нет
столбцы с общим количеством оценок от всех пользователей на фильм и суммарной оценкой от всех пользователей

In [ ]:
overall_rating_count = df_ratings.groupby('item_id').count()
overall_rating_count = overall_rating_count.rename(columns={'rating': 'overall_rating_count'})
overall_rating_count.head()

         user_id  overall_rating_count  timestamp
item_id
1            452                   452        452
2            131                   131        131
3             90                    90         90
4            209                   209        209
5             86                    86         86

In [ ]:
avg_rating = df_ratings.groupby('item_id').mean()
avg_rating = avg_rating.rename(columns={'rating': 'avg_rating'})
avg_rating.head()

            user_id  avg_rating     timestamp
item_id
1        477.011062    3.878319  8.828054e+08
2        492.007634    3.206107  8.834174e+08
3        459.133333    3.033333  8.822269e+08
4        469.497608    3.550239  8.827175e+08
5        439.372093    3.302326  8.825882e+08

In [ ]:
df_405 = df_405.merge(overall_rating_count,left_on='item_id', right_on='item_id', how='left')
df_405.head()

   user_id_x  item_id  rating  ...  user_id_y  overall_rating_count  timestamp_y
0        405       56       4  ...        394                   394          394
1        405      592       1  ...          9                     9            9
2        405     1582       1  ...          1                     1            1
3        405      171       1  ...         65                    65           65
4        405      580       1  ...         32                    32           32

[5 rows x 7 columns]

In [ ]:
df_405 = df_405.merge(avg_rating,left_on='item_id', right_on='item_id', how='left')
df_405.head()

   user_id_x  item_id  rating  ...     user_id  avg_rating     timestamp
0        405       56       4  ...  453.205584    4.060914  8.828940e+08
1        405      592       1  ...  289.222222    3.333333  8.847591e+08
2        405     1582       1  ...  405.000000    1.000000  8.855487e+08
3        405      171       1  ...  455.907692    3.876923  8.832643e+08
4        405      580       1  ...  413.156250    3.375000  8.831793e+08

[5 rows x 10 columns]

In [ ]:
df_movies['release date'] = df_movies['release date'].str[-4:]
df_movies.head()

   movie id        movie title release date  ...  Thriller War  Western
0         1   Toy Story (1995)         1995  ...         0   0        0
1         2   GoldenEye (1995)         1995  ...         1   0        0
2         3  Four Rooms (1995)         1995  ...         1   0        0
3         4  Get Shorty (1995)         1995  ...         0   0        0
4         5     Copycat (1995)         1995  ...         1   0        0

[5 rows x 24 columns]

In [ ]:
df_405 = df_405.merge(df_movies,left_on='item_id', right_on='movie id', how='left')
df_405.head()

   user_id_x  item_id  rating  timestamp_x  ...  Sci-Fi  Thriller  War  Western
0        405       56       4    885544911  ...       0         0    0        0
1        405      592       1    885548670  ...       0         1    0        0
2        405     1582       1    885548670  ...       0         0    0        0
3        405      171       1    885549544  ...       1         0    0        0
4        405      580       1    885547447  ...       0         0    0        0

[5 rows x 34 columns]

In [ ]:
df_405.columns

Index(['user_id_x', 'item_id', 'rating', 'timestamp_x', 'user_id_y',
       'overall_rating_count', 'timestamp_y', 'user_id', 'avg_rating',
       'timestamp', 'movie id', 'movie title', 'release date',
       'video release date', 'IMDb URL', 'unknown', 'Action', 'Adventure',
       'Animation', 'Childrens', 'Comedy', 'Crime', 'Documentary', 'Drama',
       'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery', 'Romance',
       'Sci-Fi', 'Thriller', 'War', 'Western'],
      dtype='object')

In [ ]:
df = df_405 [['rating','overall_rating_count','avg_rating','release date','unknown', 'Action', 'Adventure',
       'Animation', 'Childrens', 'Comedy', 'Crime', 'Documentary', 'Drama',
       'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery', 'Romance',
       'Sci-Fi', 'Thriller', 'War', 'Western']]
df.head()

   rating  overall_rating_count  avg_rating  ... Thriller  War  Western
0       4                   394    4.060914  ...        0    0        0
1       1                     9    3.333333  ...        1    0        0
2       1                     1    1.000000  ...        0    0        0
3       1                    65    3.876923  ...        0    0        0
4       1                    32    3.375000  ...        0    0        0

[5 rows x 23 columns]

Проверяем, есть ли пустые значения

In [ ]:
df.isnull().values.any()

False

Сформируйте X_train, X_test, y_train, y_test

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [ ]:
df.columns

Index(['rating', 'overall_rating_count', 'avg_rating', 'release date',
       'unknown', 'Action', 'Adventure', 'Animation', 'Childrens', 'Comedy',
       'Crime', 'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror',
       'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War',
       'Western'],
      dtype='object')

In [ ]:
X = df[['overall_rating_count','avg_rating','release date','unknown', 'Action', 'Adventure',
       'Animation', 'Childrens', 'Comedy', 'Crime', 'Documentary', 'Drama',
       'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery', 'Romance',
       'Sci-Fi', 'Thriller', 'War', 'Western']]
y = df['rating']

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [ ]:
Возьмите модель линейной регрессии (или любую другую для задачи регрессии)  и обучите ее на фильмах

In [ ]:
lr = LinearRegression()

In [ ]:
lr.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
lr.coef_

array([ 8.92254722e-03,  4.17174321e-02, -6.97637679e-03, -5.27355937e-16,
       -1.63102711e-02, -2.14701154e-01, -2.52598188e-02,  5.05445840e-01,
        3.64414651e-01,  3.89760947e-02,  6.84936770e-01,  3.38897929e-01,
       -2.01120545e-01, -4.20522100e-01,  3.20662882e-01,  2.80768898e-01,
        6.20604277e-02, -1.18926179e-01, -3.90375357e-03,  3.30945487e-01,
       -2.96144223e-01,  4.63374942e-02])

Оцените качество модели на X_test, y_test при помощи метрик для задачи регрессии

In [ ]:
pd.DataFrame([y_test.values, lr.predict(X_test)]).T

       0         1
0    1.0  2.564061
1    2.0  1.395735
2    4.0  1.119100
3    1.0  2.164110
4    1.0  1.182465
..   ...       ...
143  1.0  2.075847
144  1.0  1.207694
145  1.0  3.489456
146  2.0  1.873598
147  1.0  2.250530

[148 rows x 2 columns]

In [ ]:
from sklearn.metrics import mean_squared_error

In [ ]:
mean_squared_error(y_test, lr.predict(X_test))

1.1323116878806045